SERVICES = {
    1: {
        'name': 'Консультация по выбору щенка',
        'description': None,
        'option_groups': [
            {
                'title': '❔«Не уверен, какой щенок мне подходит»',
                'options': [
                    {
                        'id': 1,
                        'title': 'Помощь в определении подходящего щенка и заводчика с консультациями и советами.',
                        'price': '4000 руб.',
                        'description': '<strong>— Что вы узнаете?</strong>',
                        'features': [
                            'Поймете, какой щенок подходит именно вам — по стилю жизни, графику, активности, опыту, составу семьи.',
                            'Выберете породу не по внешности, а по характеру и потребностям.',
                            'Начнете отличать добросовестного заводчика от случайного продавца.',
                            'Научитесь задавать правильные вопросы, видеть «красные флаги».',
                            'Узнаете, что важно в справках, анализах и генетических тестах.',
                            'Поймете, на что обращать внимание в условиях содержания щенка у заводчика.',
                            'Научитесь проводить мини-тест щенка перед выбором и видеть именно вашего.',
                            'Узнаете, что должно быть в договоре, как оценивать риски и на что обращать внимание.',
                            'Грамотно организуете переезд и первые 48 часов дома— без стресса, с нужной экипировкой и безопасностью.',
                            'Сможете избежать самых распространённых ошибок первых недель.'
                        ],
                        'plan': [
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.',
                            'После прохождения курса, скидка 20% на выезд с вами к заводчику.'
                        ],
                        'link': {
                            'text': 'Подробнее',
                            'url': 'https://doggy-logy.ru/we-are-charge'
                        }
                    }
                ]
            },
            {
                'title': '❔«Хочу найти надежного заводчика»',
                'options': [
                    {
                        'id': 2,
                        'title': 'Поиск заводчика по вашему запросу с поддержкой специалиста',
                        'price': '20 000 руб.',
                        'features': [
                            'Поиск заводчиков с подходящими щенками и поддержка ветеринара-кинолога.',
                            'До 3 видеозвонков с заводчиками.',
                            'Специалист покажет лучшие варианты и поможет с выбором.',
                            'Выезд к заводчику возможен, оплачивается отдельно.'
                        ]
                    },
                    {
                        'id': 3,
                        'title': 'Анализ предложенных вами заводчиков',
                        'price': '1000 руб / каждые 3 заводчика',
                        'features': [
                            'Вы отправляете нам выбранных заводчиков, мы рассказываем о их репутации в профильных кругах.',
                            'Если заводчик малоизвестен, общение с ним осуществляется через сообщения.'
                        ]
                    }
                ]
            },
            {
                'title': '❔«Выбрал заводчика, нужно мнение специалиста»',
                'options': [
                    {
                        'id': 4,
                        'title': 'Видеосозвон с выбранным заводчиком для осмотра щенков и документов',
                        'price': '3000 руб.',
                        'features': [
                            'Видеозвонок с выбранным Вами заводчиком: просмотр щенков, оценка условий содержания, проверка документов и помощь в выборе щенка из помёта.'
                        ]
                    },
                    {
                        'id': 5,
                        'title': 'Выезд с Вами к заводчику (в пределах МКАД) для осмотра щенков и условий',
                        'price': '4500 руб.',
                        'features': [
                            'Выезд к выбранному Вами заводчику: осмотр щенков, оценка условий содержания, проверка документов и помощь в выборе щенка из помёта.'
                        ]
                    }
                ]
            }
        ]
    },
    2: {
        'name': 'Первые навыки щенка',
        'description': 'Ответственный старт большой дружбы, без разочарований, проблем и "а если бы я знал это раньше…"<br><br><strong>Пока щенок на карантине, давайте заложим самые важные навыки на дистанционных занятиях!</strong>',
        'option_groups': [
            {
                'title': 'Тарифы:',
                'options': [
                    {
                        'id': 1,
                        'title': 'Базовый',
                        'price': '4500 руб.',
                        'description': None,
                        'features': [
                            '<strong>— Чему научитесь вы?</strong>',
                            'Создавать безопасную и предсказуемую среду для адаптации.',
                            'Приучите щенка к туалету без криков и наказаний через режим, наблюдение и поощрение.',
                            'Грамотно организуете кормление, сон и нагрузку.',
                            'Поймете, как щенок "говорит", что от него ждать.',
                            'Научитесь контролировать кусание и прыжки без срывов.',
                            'Безопасно познакомите питомца с улицей, звуками, людьми, собаками.',
                            'Научите щенка оставаться одному и сформируете уверенность.',
                            'Начнете обучать простым командам с учётом возраста и психики.',
                            'Будете развивать у щенка самоконтроль как основу будущего послушания.',
                            'Сформируете доверие.',
                            '<strong>— Чему научится щенок?</strong>',
                            'Откликаться на имя, искать взгляд.',
                            'Спокойно оставаться дома один, с пониманием, что это не страшно и человек всегда возвращается.',
                            'Понимать, где место для сна, еды и туалета.',
                            'Контролировать возбуждение, переключаться с возбуждённых состояний через игры, паузы, выдержку.',
                            'Изучать внешнюю среду без страха и паники.',
                            'Контролировать свои силы в игре, не кусаться и не прыгать навязчиво.',
                            'Самостоятельно отдыхать, а не всё время просить внимания.',
                            'Чувствовать себя уверенно в новом доме.'
                        ],
                        'plan': [
                            'Обучение рассчитано на 1 месяц.',
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'После каждого урока вам выдается домашнее задание с практическими упражнениями.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.'
                        ],
                        'link': None
                    },
                    {
                        'id': 2,
                        'title': 'Расширенный',
                        'price': '6500 руб.',
                        'description': None,
                        'features': [
                            'Этот Тариф содержит весь материал по Тарифу "Базовый" (1️⃣) и дает Вам возможность обратиться с вопросом к кинологу.',
                            'Изучение с проверкой 6 домашних заданий и коррекцией ошибок.'
                        ]
                    },
                    {
                        'id': 3,
                        'title': 'Оффлайн',
                        'price': '11000 руб.',
                        'description': None,
                        'features': [
                            'Этот Тариф содержит весь материал по Тарифу "Базовый" (1️⃣) и дает Вам возможность обратиться с вопросом к кинологу.',
                            'Проверка 6 домашних заданий и коррекция ошибок;',
                            '1 выезд к собаке (в пределах МКАД)/ либо 2 индивидуальных онлайн-занятия).'
                        ]
                    }
                ]
            }
        ],
        'footer_link': {
            'text': 'Смотреть на сайте',
            'url': 'https://doggy-logy.ru/we-are-charge'
        }
    }
}