SERVICES = {
    1: {
        'name': 'Консультация по выбору щенка',
        'description': None,
        'form_note': None,
        'option_groups': [
            {
                'title': '❔«Не уверен, какой щенок мне подходит»',
                'options': [
                    {
                        'id': 1,
                        'title': 'Помощь в определении подходящего щенка и заводчика с консультациями и советами.',
                        'price': '4000 руб.',
                        'description': '<strong>— Что вы узнаете?</strong>',
                        'features': [
                            'Поймете, какой щенок подходит именно вам — по стилю жизни, графику, активности, опыту, составу семьи.',
                            'Выберете породу не по внешности, а по характеру и потребностям.',
                            'Начнете отличать добросовестного заводчика от случайного продавца.',
                            'Научитесь задавать правильные вопросы, видеть «красные флаги».',
                            'Узнаете, что важно в справках, анализах и генетических тестах.',
                            'Поймете, на что обращать внимание в условиях содержания щенка у заводчика.',
                            'Научитесь проводить мини-тест щенка перед выбором и видеть именно вашего.',
                            'Узнаете, что должно быть в договоре, как оценивать риски и на что обращать внимание.',
                            'Грамотно организуете переезд и первые 48 часов дома— без стресса, с нужной экипировкой и безопасностью.',
                            'Сможете избежать самых распространённых ошибок первых недель.'
                        ],
                        'plan': [
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.',
                            'После прохождения курса, скидка 20% на выезд с вами к заводчику.'
                        ],
                        'link': {
                            'text': 'Подробнее',
                            'url': 'https://doggy-logy.ru/we-are-charge'
                        }
                    }
                ]
            },
            {
                'title': '❔«Хочу найти надежного заводчика»',
                'options': [
                    {
                        'id': 2,
                        'title': 'Поиск заводчика по вашему запросу с поддержкой специалиста',
                        'price': '20 000 руб.',
                        'features': [
                            'Поиск заводчиков с подходящими щенками и поддержка ветеринара-кинолога.',
                            'До 3 видеозвонков с заводчиками.',
                            'Специалист покажет лучшие варианты и поможет с выбором.',
                            'Выезд к заводчику возможен, оплачивается отдельно.'
                        ]
                    },
                    {
                        'id': 3,
                        'title': 'Анализ предложенных вами заводчиков',
                        'price': '1000 руб / каждые 3 заводчика',
                        'features': [
                            'Вы отправляете нам выбранных заводчиков, мы рассказываем о их репутации в профильных кругах.',
                            'Если заводчик малоизвестен, общение с ним осуществляется через сообщения.'
                        ]
                    }
                ]
            },
            {
                'title': '❔«Выбрал заводчика, нужно мнение специалиста»',
                'options': [
                    {
                        'id': 4,
                        'title': 'Видеосозвон с выбранным заводчиком для осмотра щенков и документов',
                        'price': '3000 руб.',
                        'features': [
                            'Видеозвонок с выбранным Вами заводчиком: просмотр щенков, оценка условий содержания, проверка документов и помощь в выборе щенка из помёта.'
                        ]
                    },
                    {
                        'id': 5,
                        'title': 'Выезд с Вами к заводчику (в пределах МКАД) для осмотра щенков и условий',
                        'price': '4500 руб.',
                        'features': [
                            'Выезд к выбранному Вами заводчику: осмотр щенков, оценка условий содержания, проверка документов и помощь в выборе щенка из помёта.'
                        ]
                    }
                ]
            }
        ]
    },
    2: {
        'name': 'Первые навыки щенка',
        'description': 'Ответственный старт большой дружбы, без разочарований, проблем и "а если бы я знал это раньше…"<br><br><strong>Пока щенок на карантине, давайте заложим самые важные навыки на дистанционных занятиях!</strong>',
        'form_note': None,
        'option_groups': [
            {
                'title': 'Тарифы:',
                'options': [
                    {
                        'id': 1,
                        'title': 'Базовый',
                        'price': '4500 руб.',
                        'description': None,
                        'features': [
                            '<strong>— Чему научитесь вы?</strong>',
                            'Создавать безопасную и предсказуемую среду для адаптации.',
                            'Приучите щенка к туалету без криков и наказаний через режим, наблюдение и поощрение.',
                            'Грамотно организуете кормление, сон и нагрузку.',
                            'Поймете, как щенок "говорит", что от него ждать.',
                            'Научитесь контролировать кусание и прыжки без срывов.',
                            'Безопасно познакомите питомца с улицей, звуками, людьми, собаками.',
                            'Научите щенка оставаться одному и сформируете уверенность.',
                            'Начнете обучать простым командам с учётом возраста и психики.',
                            'Будете развивать у щенка самоконтроль как основу будущего послушания.',
                            'Сформируете доверие.',
                            '<strong>— Чему научится щенок?</strong>',
                            'Откликаться на имя, искать взгляд.',
                            'Спокойно оставаться дома один, с пониманием, что это не страшно и человек всегда возвращается.',
                            'Понимать, где место для сна, еды и туалета.',
                            'Контролировать возбуждение, переключаться с возбуждённых состояний через игры, паузы, выдержку.',
                            'Изучать внешнюю среду без страха и паники.',
                            'Контролировать свои силы в игре, не кусаться и не прыгать навязчиво.',
                            'Самостоятельно отдыхать, а не всё время просить внимания.',
                            'Чувствовать себя уверенно в новом доме.'
                        ],
                        'plan': [
                            'Обучение рассчитано на 1 месяц.',
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'После каждого урока вам выдается домашнее задание с практическими упражнениями.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.'
                        ],
                        'link': None
                    },
                    {
                        'id': 2,
                        'title': 'Расширенный',
                        'price': '6500 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" (1️⃣) и дает Вам возможность обратиться с вопросом к кинологу.',
                        'features': ['Изучение с проверкой 6 домашних заданий и коррекцией ошибок.']
                    },
                    {
                        'id': 3,
                        'title': 'Оффлайн',
                        'price': '11000 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" (1️⃣) и дает Вам возможность обратиться с вопросом к кинологу.',
                        'features': [
                            'Проверка 6 домашних заданий и коррекция ошибок;',
                            '1 выезд к собаке (в пределах МКАД)/ либо 2 индивидуальных онлайн-занятия).'
                        ]
                    }
                ]
            }
        ],
        'footer_link': {
            'text': 'Смотреть на сайте',
            'url': 'https://doggy-logy.ru/we-are-charge'
        }
    },
    3: {
        'name': 'Дрессировка, формирование поведения',
        'description': 'Над чем Вам хотелось бы поработать?',
        'form_note': [
            'Если Вас интересует занятие с выездом, укажите, пожалуйста, адрес.'
        ],
        'option_groups': [
            {
                'title': '❓Пёсель тянет поводок и с трудом подходит по команде.',
                'options': [
                    {
                        'id': 1,
                        'title': 'Тариф «Базовый»',
                        'price': '4500 руб.',
                        'description': None,
                        'features': [
                            '<strong>— Чему научится собака?</strong>',
                            'С радостью и скоростью возвращаться по команде "Ко мне".',
                            'Понимать, что рядом с человеком быть выгодно даже без команды "Рядом".',
                            'Учиться свободе с границами: гулять, но быть включённой в контакт.',
                            'Чувствовать безопасность рядом с человеком и понимать структуру прогулки.',
                            '<strong>— Чему научитесь вы?</strong>',
                            'Формировать надёжный подзыв с первого сигнала — без повторов, криков, уговоров.',
                            'Выстраивать работу на провисшем поводке — без рывков и натяжения, сохраняя управление, но не теряя контроль.',
                            'Использовать сигналы check-in и имя как точку внимания, чтобы собака сама предлагала контакт на дистанции.',
                            'Правильно управлять поводком в городской среде и на природе, чтобы не тащить и не дергать собаку.',
                            'Справляться с возбудимостью и отвлекающими факторами при подзыве.',
                            'Справляться с откатами без паники и чувства беспомощности.'
                        ],
                        'plan': [
                            'Обучение рассчитано на 1 месяц.',
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'После каждого урока вам выдается домашнее задание с практическими упражнениями.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.'
                        ],
                        'link': None
                    },
                    {
                        'id': 2,
                        'title': 'Тариф «Расширенный»',
                        'price': '6500 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" и дает Вам возможность обратиться с вопросом к кинологу:',
                        'features': [
                            'Изучение с проверкой 6 домашних заданий и коррекцией ошибок.'
                        ],
                        'plan': None,
                        'link': None
                    },
                    {
                        'id': 3,
                        'title': 'Тариф «Оффлайн»',
                        'price': '11 000 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" и дает Вам возможность обратиться с вопросом к кинологу:',
                        'features': [
                            'Проверка 6 домашних заданий и коррекция ошибок;',
                            '1 выезд к собаке (в пределах МКАД)/ либо 2 индивидуальных онлайн-занятия).'
                        ],
                        'plan': None,
                        'link': None
                    }
                ]
            },
            {
                'title': '❓Пёсель подбирает с земли и с пола.',
                'options': [
                    {
                        'id': 4,
                        'title': 'Тариф «Базовый»',
                        'price': '4500 руб.',
                        'description': None,
                        'features': [
                            '<strong>— Чему научится собака?</strong>',
                            'Игнорировать еду, мусор, кости и прочие соблазны без стресса и конфликтов.',
                            'Выбирать "оставить" как выгодную стратегию.',
                            'Сохранять самоконтроль на прогулке в городской среде, на природе, на поводке и без него.',
                            'Заниматься с интересом, а не со страхом.',
                            'Строить новые поведенческие модели через спокойствие, паузу, взгляд.',
                            '<strong>— Чему научитесь вы?</strong>',
                            'Использовать замещающие команды и паттерны.',
                            'Проводить дроп-тесты без наказаний и резких вмешательств.',
                            'Создавать систему самоконтроля у собаки, а не зависимость от крика "Фу!"',
                            'Работать без конфликтов — без дёрганий, страха и борьбы',
                            'Понимать, как поддерживать навык в реальной жизни: в городской среде, на природе, на поводке и без него.'
                        ],
                        'plan': [
                            'Обучение рассчитано на 1 месяц.',
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'После каждого урока вам выдается домашнее задание с практическими упражнениями.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.'
                        ],
                        'link': None
                    },
                    {
                        'id': 5,
                        'title': 'Тариф «Расширенный»',
                        'price': '6500 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" и дает Вам возможность обратиться с вопросом к кинологу:',
                        'features': [
                            'Изучение с проверкой 6 домашних заданий и коррекцией ошибок.'
                        ],
                        'plan': None,
                        'link': None
                    },
                    {
                        'id': 6,
                        'title': 'Тариф «Оффлайн»',
                        'price': '11 000 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" и дает Вам возможность обратиться с вопросом к кинологу:',
                        'features': [
                            'Проверка 6 домашних заданий и коррекция ошибок;',
                            '1 выезд к собаке (в пределах МКАД)/ либо 2 индивидуальных онлайн-занятия).'
                        ],
                        'plan': None,
                        'link': None
                    }
                ]
            },
            {
                'title': '❓Хочу направить энергию собаки в правильное русло.',
                'options': [
                    {
                        'id': 7,
                        'title': 'Тариф «Базовый»',
                        'price': '4500 руб.',
                        'description': None,
                        'features': [
                            '<strong>Собака овладеет целым набором трюков</strong>:',
                            'Будет ходить змейкой, задом-наперед, замирать в разных положениях, ползать, даже выучит стороны «право» и «лево»!',
                            'Научится включать фантазию и сама придумывать, чем вас удивить!',
                            '<strong>— Чему научитесь вы?</strong>',
                            'Поймете, как обучать собаку шаг за шагом через игру и позитив.',
                            'Научитесь выстраивать тренировку грамотно: без перегруза, с уважением к телу и уму собаки.',
                            'Узнаете, как использовать команду-маркер и кликер',
                            'Узнаете, правша или левша ваша собака и научитесь развивать слабую сторону.',
                            'Всегда будете знать, на что переключить собаку и чем занять ее голову.',
                            'Узнаете, как научить собаку проявлять инициативу.',
                            '<strong>— Чему научится собака?</strong>',
                            'Улучшит физическую форму: координацию, баланс, гибкость, управление телом.',
                            'Будет заниматься с человеком легко и добровольно.',
                            'Будет получать удовольствие от общения и совместной активности.',
                            'Будет стараться сама угадать, какой трюк вы придумали.'
                        ],
                        'plan': [
                            'Обучение рассчитано на 1 месяц.',
                            'Курс состоит из 6 уроков.',
                            'Продолжительность каждого урока не более 25 минут.',
                            'После каждого урока у вас остается конспект-памятка с ключевыми моментами.',
                            'После каждого урока вам выдается домашнее задание с практическими упражнениями.',
                            'Доступ к материалам сохраняется на 3 месяца.',
                            'Делитесь успехами в чате собачников DoggyLogy.'
                        ],
                        'link': None
                    },
                    {
                        'id': 8,
                        'title': 'Тариф «Расширенный»',
                        'price': '6500 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" и дает Вам возможность обратиться с вопросом к кинологу:',
                        'features': [
                            'Изучение с проверкой 6 домашних заданий и коррекцией ошибок.'
                        ],
                        'plan': None,
                        'link': None
                    },
                    {
                        'id': 9,
                        'title': 'Тариф «Оффлайн»',
                        'price': '11 000 руб.',
                        'description': 'Содержит весь материал по Тарифу "Базовый" и дает Вам возможность обратиться с вопросом к кинологу:',
                        'features': [
                            'Проверка 6 домашних заданий и коррекция ошибок;',
                            '1 выезд к собаке (в пределах МКАД)/ либо 2 индивидуальных онлайн-занятия).',
                            'Для занятия собака должна быть голодной.',
                            'Используйте мелко нарезанное лакомство или корм из пайки.',
                            'Возьмите любимую игрушку собаки.',
                            'Подготовьте привычную амуницию.',
                            'Коррекция поведения',
                            'Работа со страхами',
                            'Обучение командам',
                            'Трюки/аджилити',
                            'На решение проблемы обычно требуется 3-4 занятия:'
                        ],
                        'plan': None,
                        'link': None
                    }
                ]
            },
            {
                'title': None,
                'options': [
                    {
                        'id': 10,
                        'title': 'Онлайн-консультация',
                        'price': '3000 руб.',
                        'description': None,
                        'features': ['Продолжительность — до 1 часа, возможна разовая или системная поддержка для решения любого вопроса'],
                        'plan': None,
                        'link': None
                    },
                    {
                        'id': 11,
                        'title': 'Занятие с выездом по Москве',
                        'price': '4500 руб.',
                        'description': None,
                        'features': ['Занятие проведет один из кинологов команды, наиболее подходящий к вашему запросу.'],
                        'plan': None,
                        'link': None
                    },
                    {
                        'id': 12,
                        'title': 'Занятие на площадке или в зале',
                        'price': '4500 руб.',
                        'description': None,
                        'features': ['Ведёт Валерия Попова; Территория жк Сердце Столицы (Шелепихинская набережная) и ближайшие районы. В зале: Москва, 2-я Магистральная улица, 16, стр. 7'],
                        'plan': None,
                        'link': None
                    }
                ]
            }
        ],
        'footer_link': {
            'text': 'Подробнее',
            'url': 'https://doggy-logy.ru/we-are-charge'
        }
    },
    4: {
        'name': 'Ветеринар',
        'description': '👩‍⚕️ Профессиональная помощь по любому вопросу, касающемуся здоровья и ухода за вашим питомцем.',
        'form_note': [
            'Если Вас интересует консультация с выездом, укажите, пожалуйста, адрес.'
        ],
        'option_groups': [
            {
                'title': None,
                'options': [
                    {
                        'id': 1,
                        'title': 'Консультация',
                        'price': '3000 руб.',
                        'description': None,
                        'features': [
                            'Консультации по необходимости и сроках прививок и обработок.',
                            'Поможем подготовиться к международному перелёту: расскажем о требуемых прививках и документации.',
                            'Предоставим второе мнение по диагнозу и лечению от опытных ветеринарных специалистов.',
                            'Подскажем надежные клиники с профильными специалистами и порекомендуем, куда лучше обратиться в зависимости от вашего запроса.',
                            'Продолжительность онлайн-консультации— до 1 часа.'
                        ],
                        'plan': None,
                        'link': None
                    },
                    {
                        'id': 2,
                        'title': 'Консультация с выездом к собаке',
                        'price': 'от 4000 руб.',
                        'description': None,
                        'features': ['Осмотр и профессиональные рекомендации в зависимости от Вашего запроса.'],
                        'plan': None,
                        'link': None
                    }
                ]
            }
        ],
        'footer_link': None
    },
    5: {
        'name': 'Груминг',
        'description': 'Порекомендуем груминг-салоны с гуманным подходом и проверенными специалистами.',
        'form_note': [
            'Укажите, в каком районе Вы находитесь.',
            'Сообщите, какой вид груминга Вас интересует: для дома или подготовка к выставке.'
        ],
        'option_groups': [
            {
                'title': None,
                'options': [
                    {
                        'id': 1,
                        'title': 'Рекомендация груминг-салонов',
                        'price': 'Бесплатно',
                        'description': None,
                        'features': [
                            'Подбор проверенных груминг-салонов с гуманным подходом',
                            'Рекомендации основаны на отзывах и опыте других клиентов',
                            'Учитываем расположение, специализацию и подход к животным'
                        ],
                        'plan': None,
                        'link': None
                    }
                ]
            }
        ],
        'footer_link': None
    },
    6: {
        'name': 'Передержка',
        'description': None,
        'form_note': [
            'Расскажите о режиме вашей собаки.',
            'Опишите особенности поведения (например, портит что-то дома, ходит в туалет дома вне пелёнки, тянет поводок, не остается одна, конфликтует с собаками на улице и т.д.)',
            'Получает ли собака какие-то лекарства.',
            'Понадобятся ли дополнительные услуги (дрессировка, зоотакси, груминг)'
        ],
        'option_groups': [
            {
                'title': None,
                'options': [
                    {
                        'id': 1,
                        'title': 'Передержка для собак',
                        'price': 'от 1 800 руб./день',
                        'description': None,
                        'features': [
                            'Цена зависит от запроса и потребностей собаки.',
                            'Мы не принимаем собак массово; каждый специалист может взять одну или несколько собак в зависимости от запроса.',
                            '<strong>Как подготовиться к передержке:</strong>',
                            'Передайте привычный корм, миски, лежанку, амуницию и любимую игрушку.',
                            'При необходимости — пеленки, вкусняшки, расчески, одежда, уходовая косметика',
                            'Собака должна быть обработана от паразитов и вакцинирована по графику.',
                        ],
                        'plan': None,
                        'link': None
                    }
                ]
            }
        ],
        'footer_link': None
    }
}

SURVEY_FORM_TEXT = """
📊 <b>Новая заявка по услуге:</b> {service_name}\n
✅ <b>Выбранный вариант:</b>
{selected_option}\n
📝 <b>Описание ситуации</b>:
{free_form}
👤<b>Пользователь</b> @{username}:
{contact_text}
🎟️ <b>Промокод</b>: <code>{promo_code}</code>
"""
