ABOUT_TEXT = """<b>Какая услуга Вам актуальна?</b>\n
🐶 <b>Для собачек</b>:
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=1">Если выбираете щенка</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=2">Первые навыки щенка</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=3">Дрессировка, формирование поведения</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=4">Ветеринар</a> 
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=5">Груминг</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=6">Передержка</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=7">Зооняня и выгул</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=8">Групповые занятия</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=9">Подготовка к выставкам</a>\n
🐈 <b>Для котиков</b>:
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=10">Формирование поведения </a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=11">Ветеринар</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=12">Передержка</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=13">Зооняня</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=14">Груминг</a>\n
🐾 <b>Для собачек и котиков</b>:
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=15">Кастинг питомцев для съемок</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=16">Зоотакси</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=17">Диетолог для животных</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=18">Пэт-фотограф</a>
• <a href="https://t.me/DoggyLogy_bot/survey?startapp=19">Страхование здоровья питомцев</a>\n
✨<b>Профессиональный кинолог</b>:
• <a href="https://dikidi.net/1932230">Запись к зооспециалисту Валерии Поповой</a>"""

PROMO_CODE_NOT_ENABLED = """\n👤 <b>Заполните профиль</b>, чтобы использовать все возможности сервиса!\n"""

MENU_TEXT = """• Поможем определиться, <b>какой щенок подойдет</b> именно вам.\n
• Научим, <b>как не испортить всё в первый месяц</b>, а после приедем и <b>позанимаемся индивидуально.</b>\n
• <b>Формирование поведения взрослой собаки</b>: от базовых алгоритмов к личному сопровождению <b>до полного результата.</b>\n
• Делимся с нашими клиентами рекомендациями только <b>проверенных специалистов.</b>\n
• Есть своя база <b>питомцев-актеров</b>, работающих на крупнейших проектах.\n
⚙️ В разделе <b>«Инструкция»</b> рассказали, как пользоваться ботом.
{promo_code_text}
{contact_text}"""

CONTACT_TEXT = """🙋‍♀️ <b>Контактная информация:
@doggy_logy
@manager_DoggyLogy</b>\n
🌐 Следите за нами в социальных сетях: - <a href="https://doggy-logy.ru/">Сайт</a> | <a href="https://vk.com/doggylogy">VK</a> | <a href="https://youtube.com/@doggylogy?si=TfojM_-KXnH6YckN">YouTube</a> | <a href="https://t.me/DoggyLogyChannel">Наш канал</a> | <a href="https://t.me/DoggyLogy">Чат</a> | <a href="https://www.instagram.com/doggy.logy">Instagram</a> | <a href="https://www.tiktok.com/@doggy.logy?_t=ZS-90EzzqHoy5X&_r=1">TikTok</a>"""

PROFILE_TEXT = """👤 <b>Ваш профиль</b>\n
🎭 <b>О вас</b>:\n{user}
🐶 <b>Ваши питомцы</b>:\n\n{pets}
🎟️ <b>Ваш промокод</b>: <code>{promo_code}</code>"""

NONE_PROFILE_TEXT = """👤 <b>Ваш профиль</b>\n\n<i>Вы ещё не указали никаких данных!</i>"""

USER_FORM_TEXT = """👤 <b>Анкета пользователя:</b>\n
🎭 <b>Личные данные</b>:\n{user}
🐶 <b>Питомцы</b>:\n\n{pets}
🎟️ <b>Промокод</b>: <code>{promo_code}</code>"""

FORM_TEXT = """❗Перед заполнением ознакомьтесь с <a href="https://telegra.ph/POLITIKA-KONFIDENCIALNOSTI-v-otnoshenii-obrabotki-i-zashchity-personalnyh-dannyh-na-sajte-httpsdoggy-logyru-04-19">Политикой конфиденциальности</a>.\n
⭐ <b>️Заполните анкету для активации услуг сервиса.</b>"""

LIST_OF_FORMS = """📝 <b>Анкеты:</b>"""

CONSULTATION_TEXT = """<b>Выберите категорию</b>:"""

SELECTION_TEXT = """🔥 <b>Наши друзья дарят вам скидки</b>:\n
• <b>HUNTERPET</b>
Корм, который едят наши собаки и рекомендует наш ветеринар‑диетолог.  
По промокоду <code>doggylogy</code> — скидка 20% на весь ассортимент до 31.12.2025.
ℹ️ <b>Подробнее</b>: <a href="https://hunter-pet.ru">сайт</a>, консультация по корму и лакомствам - +74954812228."""

ADMIN_PANEL_TEXT = """🛡 <b>Админ-панель</b>\n
📊 <b>Статистика</b>:
👥 <i>Пользователи</i>: <code>{users_len}</code>
👮‍♂️ <i>Администраторы</i>: <code>{admins_len}</code>
📝 <i>Анкеты</i>: <code>{form_len}</code>"""

USER_BLOCKED_TEXT = """❌ <b>Вы заблокированы, для разблокировки свяжитесь с администрацией.</b>"""

PROFILE_COMPLETE_TEXT = """<b>✅ Ваш профиль успешно заполнен.</b>"""

CHOOSE_TREATMENT = """🐶 <b>Тип обработки:</b>"""

CHOOSE_PET_TYPE = """🐾 <b>Тип питомца:</b>"""

CHOOSE_MEDICAMENT = """💊 <b>Лекарственный препарат:</b>"""

CHOOSE_PERIOD = """🗓 <b>Период:</b>"""

VACCINATION = """🦠 <i>Вакцинацию от вирусных инфекций и бешенства рекомендуется проводить ежегодно.</i>\n\n""" + CHOOSE_MEDICAMENT

CHOOSE_SPECIAL_PERIOD = """🗓 <b>Введите период в днях:</b>"""

CHOOSE_SPECIAL_MEDICAMENT = """💊 <b>Введите название лекарственного препарата:</b>"""

REMINDER_TEXT = """❗ <b>Напоминание:</b>\n
• <b>Питомец</b>: <i>{pet}</i>
• <b>Тип</b>: <i>{treatment}</i>
• <b>Лекарство</b>: <i>{medicament}</i> 💊
• <b>Начало</b>: <i>{start_date}</i>
• <b>Конец</b>: <i>{end_date}</i>
• <b>Период</b>: <i>{period} дней</i>
"""

REMINDER_TEXT_EDIT = """❗ <b>Напоминание:</b>\n
• <b>Питомец</b>: <i>{pet}</i>
• <b>Тип</b>: <i>{treatment}</i>
• <b>Лекарство</b>: <i>{medicament}</i> 💊
• <b>Начало</b>: <i>{start_date}</i>
• <b>Период</b>: <i>{period} дней</i>
"""

NONE_REMINDER_TEXT = """<b>У Вас нет активных напоминаний!</b>"""

ADD_REMINDER_SUCCESSFUL_TEXT = """✅ <b>Вы успешно добавили напоминание!</b>"""

CHOOSE_START_DATE = """🗓 <b>Выберите дату начала:</b>"""

USERS_TEXT = """👥 <b>Пользователи:</b>"""

ADMINS_TEXT = """👮‍♂️ <b>Администраторы:</b>"""

USER_INFO_TEXT = """👤 <b>{full_name} (ID: {user_id})</b>
<b>Статус:</b> <code>{user_status}</code>"""

ERROR_TEXT = """🚫 <b>Произошла ошибка!</b>"""

TRY_AGAIN_ERROR = """🚫 <b>Произошла ошибка! Попробуйте заново.</b>"""

NON_FORMAT_TEXT = """🚫 <b>Вы ввели неверный формат данных!</b>"""

DELETE_TASK_COMPLETE = """✅ <b>Вы успешно удалили напоминание!</b>"""

USER_PROFILE_TEXT = """<b>ФИО</b>: <code>{full_name}</code>
<b>Телефон</b>: <code>{phone_number}</code>
<b>Дата рождения</b>: <code>{birth_date}</code>
<b>Возраст</b>: <code>{age}</code>\n"""

PET_PROFILE_TEXT = """<b>{count}. {emoji} {name}</b>
<b>Вес</b>: <code>{approx_weight} кг</code>
<b>Дата рождения</b>: <code>{birth_date}</code>
<b>Возраст</b>: <code>{age}</code>
<b>Вид</b>: <code>{type}</code>
<b>Пол</b>: <code>{gender}</code>
<b>Порода</b>: <code>{breed}</code>\n"""

CONSULTATION_HELP = """<b>🧰 Памятка аптечка первой помощи</b>"""

CONSULTATION_ZOO = """<b>📝 Памятка от зооюриста</b>"""

CONSULTATION_CATS_CARE = """<b>🐈 Забота о котиках</b>"""

CONSULTATION_CATS_GAME = """<b>🎮🐱 Полезные игры с котиком</b>"""

CHOOSE_PROMO_CODE_ADMIN = """🎟 Отправьте <b>индивидуальный промокод</b> пользователя:"""

WRONG_PROMO_CODE = """🚫 Промокод должен начинаться с <b>DL</b> и иметь длину в <b>8 символов!</b>"""

CHOOSE_ACTION = """Выберите следующее действие:"""

REMINDER_EDIT_COMPLETE = """✅ <b>Вы успешно обновили напоминание!</b>"""


MAGIC_TEXT = """🐶 <b>DoggyLogy</b>: эффективное решение для быстрого исправления поведения собак и кошек без лишних хлопот.
Если заниматься не хочется, поможет немного магии.
🛒 <b>Заказать на <a href='https://www.ozon.ru/seller/doggy-logy-2422068/products/?miniapp==seller_2422068'>OZON</a></b>."""

MAGIC_CARD_TEXT = """🕯️ В подарок к каждой свечке — <b>персональная натальная карта</b> для вашего любимца!\n
Заполните профиль и отправьте фото питомца со свечкой.
Не забудьте указать <b>индивидуальный промокод</b> (<code>{promo_code}</code>), чтобы расчеты были достоверными.\n
<b><i>Обратная связь - @manager_DoggyLogy.</i></b>"""

MAGIC_INSTRUCTION_TEXT = """⚙️ Инструкция"""

RECOMMENDATION_TEXT = """🐾Здесь вы можете порекомендовать грумера, ветеринара, зооняню или другого специалиста, которым вы довольны.
👥 Пожалуйста, <b>оставьте контактную информацию</b> специалиста — чтобы помочь начинающим владельцам. 
Спасибо, что делитесь!"""

RECOMMENDATION_FROM_USER_TEXT = """🐾 Пользователь {name} (@{username}) рекомендует Вам следующий пэт-бренд: {brand}"""

RECOMMENDATION_TEXT_SUCCESS = """✅ Вы успешно порекомендовали пэт-бренд!"""