ABOUT_TEXT = """👋 Вас приветствует сервис <b>Doggy Logy</b>\n
Мы работаем только с <b>проверенными компаниями</b>, которым <b>доверяем сами</b>. Здесь вы можете приобрести нашу <b>программу лояльности</b>\n
<i>Скидки действуют на всех наших партнеров, 1 раз в месяц на каждого партнера</i>\n
<i>Создатель бренда Doggy Logy: Валерия Попова @doggy_logy</i>"""

MENU_TEXT = """👋 Вас приветствует сервис <b>Doggy Logy</b>\n
Мы работаем только с <b>проверенными компаниями</b>, которым <b>доверяем сами</b>. Здесь вы можете приобрести нашу <b>программу лояльности</b>\n
<i>Скидки действуют на всех наших партнеров, 1 раз в месяц на каждого партнера</i>\n
<i>Получите промокод после заполнения формы.</i>"""

PROFILE_TEXT = """👤 <b>Ваш профиль</b>\n
🎭 <b>О вас:</b>
<b>Полное имя</b>: <code>{full_name}</code>
<b>Номер телефона</b>: <code>{phone_number}</code>
<b>Дата рождения</b>: <code>{birth_date}</code>
<b>Возраст</b>: <code>{age} лет</code>\n
🐶 <b>Ваши питомцы:</b>\n{pets}"""

NONE_PROFILE_TEXT = """👤 <b>Ваш профиль</b>\n\n<i>Вы ещё не указали никаких данных!</i>"""

FORM_TEXT = """👇 <b>Для заполнения формы нажмите на кнопку ниже.</b>"""

ADMIN_PANEL_TEXT = """🛡 <b>Админ-панель:</b>"""

USER_BLOCKED_TEXT = """❌ <b>Вы заблокированы, для разблокировки свяжитесь с администрацией.</b>"""

FUNCTION_ERROR_TEXT = """❌ <b>Вам недоступна эта функция.</b>"""

REDEEM_CODE_TEXT = """📇 <b>Списать промокод:</b>"""

CODE_ERROR_TEXT = """⚠ <b>Этот промокод неверный.</b>"""

FORMAT_ERROR_TEXT = """⚠ <b>Введён промокод неверного формата.</b>"""

PROFILE_COMPLETE_TEXT = """<b>Ваш профиль успешно заполнен.</b>"""

PROFILE_ERROR_TEXT = """❌ <b>Предоставлены недействительные данные.</b>"""