ABOUT_TEXT = """<b>🐶 Doggy Logy</b> - это сервис для владельцев собак и кошек.

• @KinoSobaki_bot - подбор животных для съемок
• <a href="https://doggy-logy.ru/vmi">Консультации ветеринара</a>
• <a href="https://doggy-logy.ru/vmi">Страхование здоровья питомца</a>
• <a href="https://t.me/doggy_logy">Гуманная коррекция поведения/обучение командам</a>
• <a href="https://t.me/doggy_logy">Помощь с выбором щенка</a>
• <a href="https://t.me/doggy_logy">Передержка</a>
• <a href="https://guldog.ru/">Догситтер/выгул</a>
• <a href="https://t.me/doggy_logy">Разработка рациона</a>
• <a href="https://t.me/doggy_logy">Подготовка к выставкам</a>
• <a href="https://businka.pet/">Груминг</a> (промокод <code>DOGGYLOGY</code>)
• <a href="https://t.me/manager_DogyLogy">Зооюрист</a>
• <a href="https://zootaxist.ru/">Зоотакси</a>
• <a href="https://t.me/manager_DogyLogy">Пэт-фотограф</a>

Есть идеи, как улучшить сервис? Напишите нам! 🐶
@manager_DogyLogy
@doggy_logy

С любовью к собакам и их людям❤️

👥 Наши соцсети - <a href="https://doggy-logy.ru">сайт</a>, <a href="https://t.me/DoggyLogyChannel">канал</a>, <a href="https://t.me/DoggyLogy">чат</a>."""

PROMO_CODE_ENABLED = """• Индивидуальный: <code>{promo_code}</code>"""

PROMO_CODE_NOT_ENABLED = """<i>• Получите индивидуальный промокод после заполнения формы (/form).</i>"""

MENU_TEXT = """🐶 <b>Всё, что нужно вашему питомцу – в бесплатной подписке!</b>

✅ <b>Аптечка первой помощи</b> – будь готов к любой ситуации  
✅ <b>Советы экспертов</b> - ветеринар, зоопсихолог и зооюрист помогут вам  
✅ <b>Календарь обработок</b> – здоровье питомца под контролем  
✅ <b>Скидки и бонусы</b> от проверенных брендов  
✅ <b>И многое другое!</b>\n
✨ <b>Заботьтесь о собаке легко – начните прямо сейчас!</b>\n
<b>🎟 Промокоды:</b>
• Общий - <code>DOGGYLOGY</code>\n"""


PROFILE_TEXT = """👤 <b>Ваш профиль</b>\n
🎭 <b>О вас</b>:
<b>Полное имя</b>: <code>{full_name}</code>
<b>Номер телефона</b>: <code>{phone_number}</code>
<b>Дата рождения</b>: <code>{birth_date}</code>
<b>Возраст</b>: <code>{age} лет</code>\n
🐶 <b>Ваши питомцы</b>:\n\n{pets}
🎟️ <b>Ваш промокод</b>: <code>{promo_code}</code>"""

NONE_PROFILE_TEXT = """👤 <b>Ваш профиль</b>\n\n<i>Вы ещё не указали никаких данных!</i>"""

FORM_TEXT = """👇 <b>Для заполнения формы нажмите на кнопку ниже.</b>"""

# CONSULTATION_TEXT = """👨‍⚕️ В нашем сервисе можно получить <b>1 бесплатную</b> консультацию врача.
# <i>Сформулируйте и отправьте свой вопрос @doggy_logy</i>"""

CONSULTATION_TEXT = """<b>Выберите категорию</b>:"""

SELECTION_TEXT = """🐶 <b>Зоотовары</b>:\n
Подборка на OZON: <a href='https://www.ozon.ru/cart?share=jQ3wGX0'>Мелкие</a>, <a href='https://www.ozon.ru/cart?share=yzNnP5V'>средние</a> и <a href='https://www.ozon.ru/cart?share=zV1d6LP'>крупные</a> породы.
Doggy Logy на <a href='https://www.wildberries.ru/seller/3918575'>WildBerries</a>\n
Собрали для вас еще несколько бонусов:\n
1. <a href='https://vk.com/derzhismenya'>Поводки-перестежки</a>
Промокод: <code>DOGGYLOGY</code> <i>(cкидка 20%)</i>
Обратная связь: +79685872004\n
2. <a href='https://amo.si/K/RJP6LY/RI2FBC'>Ошейники/Шлейки</a> 
Промокод: <code>DOGGYLOGY</code> <i>(cкидка 15%)</i>\n
3. <a href='https://sobakamama.shop/'>Игрушки/Косметика/Миски/Полотенца/Светящиеся ошейники</a>
Промокод: <code>SOBACHKA10</code> <i>(скидка 10%)</i>\n
4. <a href='https://salopdog.ru/'>Автогамаки/одежда</a>
Промокод: <code>DOGGYLOGY</code> <i>(скидка 500р)</i>\n
"""

ADMIN_PANEL_TEXT = """🛡 <b>Админ-панель:</b>"""

USER_BLOCKED_TEXT = """❌ <b>Вы заблокированы, для разблокировки свяжитесь с администрацией.</b>"""

FUNCTION_ERROR_TEXT = """❌ <b>Вам недоступна эта функция.</b>"""

REDEEM_CODE_TEXT = """📇 <b>Списать промокод:</b>"""

CODE_ERROR_TEXT = """⚠ <b>Этот промокод неверный.</b>"""

FORMAT_ERROR_TEXT = """⚠ <b>Введён промокод неверного формата.</b>"""

PROFILE_COMPLETE_TEXT = """<b>✅ Ваш профиль успешно заполнен.</b>"""

PROFILE_ERROR_TEXT = """❌ <b>Предоставлены недействительные данные.</b>"""

CHOOSE_TREATMENT = """🐶 <b>Тип обработки:</b>"""

CHOOSE_MEDICAMENT = """💊 <b>Лекарственный препарат:</b>"""

CHOOSE_PERIOD = """🗓 <b>Период:</b>"""

CHOOSE_SPECIAL_PERIOD = """🗓 <b>Введите период в днях:</b>"""

CHOOSE_SPECIAL_MEDICAMENT = """💊 <b>Введите название лекарственного препарата:</b>"""

REMINDER_TEXT = """❗ <b>Напоминание:</b>\n
• <b>Тип</b>: <i>{treatment}</i>
• <b>Лекарство</b>: <i>{medicament}</i> 💊
• <b>Начало</b>: <i>{start_date}</i>
• <b>Конец</b>: <i>{end_date}</i>
• <b>Период</b>: <i>{period} дней</i>
"""

NONE_REMINDER_TEXT = """<b>У Вас нет активных напоминаний!</b>"""

ADD_REMINDER_SUCCESSFUL_TEXT = """✅ Вы успешно добавили напоминание!"""

OLD_REDEEMED_PROMO = """🔋 <b>Теперь вы снова можете использовать промокод у партнёра <code>{partner_name}</code>!</b>"""

CHOOSE_START_DATE = """🗓 <b>Выберите дату начала:</b>"""

CHOOSE_CATEGORY_TEXT = """🛍 <b>Категории:</b>"""

CATEGORY_NAME = """<b>{category}</b>\n\n"""

PARTNER_CATEGORY_TEXT = """• <b><a href='{url}'>{name}</a></b>\n<i>{legacy_text}</i>\n\n"""

PROMO_CODE_REDEEMED_TEXT = """✅ Промокод списан!"""

PROMO_CODE_ALREADY_REDEEMED_TEXT = """⚠ Промокод уже списан у этого партнёра."""

USER_PROMO_CODE_REDEEMED_TEXT = """✅ <b>Ваш промокод списан у партнёра <code>{partner_name}</code></b>"""

STATS_TEXT = """📊 <b>Статистика</b>:\n
Количество пользователей: <code>{users_len}</code>
Количество партнёров: <code>{partners_len}</code>
Подписок за день: <code>{orders_day} / {orders_day_sum}₽</code>
Подписок за месяц: <code>{orders_month} / {orders_month_sum}₽</code>
Подписок за год: <code>{orders_year} / {orders_year_sum}₽</code>"""

PARTNERS_TEXT = """📈 <b>Партнёры:</b>"""

USERS_TEXT = """👥 <b>Пользователи:</b>"""

USER_INFO_TEXT = """👤 <b>{full_name} (ID: {user_id})</b>
<b>Статус:</b> <code>{user_status}</code>"""

PARTNER_INFO_TEXT = """📈 <b>{partner_name} (ID: {partner_id})</b>\n
<b>ТГ партнёра:</b> {full_name} (ID: {user_id})
<b>Категория:</b> <code>{category_name}</code>
<b>Скрыт:</b> <code>{partner_status}</code>\n
{partner_url}"""

ERROR_TEXT = """🚫 Произошла ошибка!"""

TRY_AGAIN_ERROR = """🚫 Произошла ошибка! Попробуйте заново."""

NON_FORMAT_TEXT = """🚫 Вы ввели неверный формат данных!"""

DELETE_TASK_COMPLETE = """✅ Вы успешно удалили напоминание!"""

PET_PROFILE_TEXT = """<b>{count}. {emoji} {name}</b>
<b>Вес</b>: <code>{approx_weight} кг</code>
<b>Возраст</b>: <code>{age} лет</code>
<b>Дата рождения</b>: <code>{birth_date}</code>
<b>Вид</b>: <code>{type}</code>
<b>Пол</b>: <code>{gender}</code>
<b>Порода</b>: <code>{breed}</code>\n"""

CONSULTATION_FEATURES_TEXT = """🐶 Вы можете получить <b>информацию от кинолога об особенностях вашей породы</b>.\n
<b>Ваши питомцы</b>:\n\n{pets}
❓<b>Отправьте</b> данные о своей собаке и ваш индивидуальный промокод (<code>{promo_code}</code>) @doggy_logy."""

CHOOSE_CONSULTATION_FREE_TEXT = """<b>Бесплатные консультации:</b>"""

CONSULTATION_FREE_TEXT = """👨‍⚕️ Вы можете получить <b>одну бесплатную консультацию</b> ветеринара.\n
❓ <b>Сформулируйте</b> свой вопрос и <b>отправьте</b> его вместе с индивидуальным промокодом (<code>{promo_code}</code>) <i>@doggy_logy</i>."""

CONSULTATION_HELP = """<b>Памятка аптечка первой помощи</b>"""

CONSULTATION_ZOO = """<b>Памятка от зооюриста</b>"""

CONSULTATION_VIP = """
<b>⭐ VIP подписка:</b>\n
• <b>Ответственный подход</b> к содержанию собаки.
• Безлимитные консультации врача в чате <b>ежедневно с 9:00 до 22:00</b>.
• <b>Правовые консультации по провозу</b> питомца в России или за рубежом и другие вопросы.
• Выплаты до <b>50.000 руб/год</b> в случае укуса клеща, болезни или травмы.\n
<i>Стоимость: 5500 руб/год</i>
<i>Оформить: @doggy_logy</i>
<i>Подробная информация на <a href='https://doggy-logy.ru/vmi'>сайте</a>.</i>
"""